TITLE ЛР_5 
;------------------------------------------------------------------------------
;ЛР  №5
;------------------------------------------------------------------------------
; Програмування 3. Системне програмування
; Завдання:              Основи розробки і налагодження
; ВУЗ:                  КНУУ "КПІ"
; Факультет:    ФІОТ
; Курс:                1
; Група:       ІТ-03
;------------------------------------------------------------------------------
; Автор:        Куксюк Іванченко Очкас
; Дата:         14/04/21
;---------------------------------
IDEAL			; Директива - тип Асемблера tasm 
MODEL small		; Директива - тип моделі пам’яті 
STACK 2048		; Директива - розмір стеку 

DATASEG
array2Db db "7358118726277179" ; створення масиву
         db "4627022455147997"
         db "6691608838469303"
         db "1110604200317491"
         db "7512807200310748"
         db "6813005200415567"
         db "6010604200318858"
         db "7613005200414059"
         db "6612807200311791"
         db "6310604200315888"
         db "8712807200319564"
         db "1325082956458837"
         db "2080054842790953"
         db "6299944599303642"
         db "6176396115203803"
         db "2374689571001449"

CODESEG

Sort: ; сортування
    mov cx, 255 ; кількість повторів
    mov bx, 0
    mov si, 0

    l1:
    push cx ;занесення значення cx до стеку
    mov cx, 255

        l2:
        mov ah, [ds:si]  ;занесення значення для порівняння до ah
        mov al, [ds:si+1];занесення значення для порівняння до al

        cmp ah, al ;порівняння ah та al
        jl lesser ; якщо al < ah, то перейти
        greater:
            mov [ds:si], al   ;заміна значень
            mov [ds:si+1], ah ;заміна значень

        lesser:
        inc si;збільшення значення si
        loop l2;перевірка cx

    mov si, 0
    ;inc bx; збільшення значення bx
    pop cx ;діставання значення cx зі стеку
    loop l1;перевірка cx 
    jmp AfterSort

Start:
    mov ax, @data ;занесення початку датасегменту до ax
    mov ds, ax ;ініціалізація датасегменту
    mov es, ax ;ініціалізація додаткового сегменту

    jmp Sort
    AfterSort:


    mov ah,4ch
    int 21h ; виклик переривання DOS

end Start