TITLE ЛР_3 
;------------------------------------------------------------------------------
;ЛР  №3
;------------------------------------------------------------------------------
; Програмування 3. Системне програмування
; Завдання:              Основи розробки і налагодження
; ВУЗ:                  КНУУ "КПІ"
; Факультет:    ФІОТ
; Курс:                1
; Група:       ІТ-03
;------------------------------------------------------------------------------
; Автор:        Куксюк Іванченко Очкас
; Дата:         17/03/21
;---------------------------------
IDEAL			; Директива - тип Асемблера tasm 
MODEL small		; Директива - тип моделі пам’яті 
STACK 256		; Директива - розмір стеку 
;---------------------------МАКРОСИ-----------------------------
; макрос для ініціалізації
MACRO M_Init 		; Початок макросу
	mov ax,@data 	; ax <- @data
	mov ds,ax 		; ds <- ax
	mov es,ax 		; es <- ax
ENDM M_Init 		; Кінець макросу
; макрос для переміщення в масиві
MACRO M_Increment
	inc si ; збільшуємо si на 1, просуваємося по горизонталі на 1
	add bx, 10h ; збільшуємо bx на 10, просуваємося по вертикалі на 10
ENDM M_Increment	
;---------------------------ПОЧАТОК СЕГМЕНТУ ДАНИХ--------------
DATASEG
    array2Db db "#", "#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#"
             db "#", "." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"#"
             db "#", "." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"#"
             db "#", "." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"#"
             db "#", "K" ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"#"
             db "#", "." ,"V" ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"#"
             db "#", "." ,"." ,"I" ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"#"
             db "#", "." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"#"
             db "#", "." ,"." ,"." ,"." ,"I" ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"#" 
             db "#", "." ,"." ,"." ,"." ,"." ,"K" ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"#"
             db "#", "." ,"." ,"." ,"." ,"." ,"." ,"V" ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"#"
             db "#", "." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"#"
             db "#", "." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"O" ,"." ,"." ,"." ,"." ,"." ,"#"
             db "#", "." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"D" ,"." ,"." ,"." ,"." ,"#"
             db "#", "." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"." ,"H" ,"." ,"." ,"." ,"#"
             db "#", "#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#" ,"#"
exCode db 0 ; Код виходу

CODESEG
Start:
    mov ax, @data ; @data ідентифікатор, що створюється директивою model
	mov ds, ax 	; Завантаження початку сегменту даних в регістр ds 
	mov es, ax ; Завантаження початку сегменту даних в регістр es

    mov bx, 40h ; Готуємо базовий регістр, пересування по вертикалі
    mov si, 00h ;Готуємо індексний регістр, пересування по горізонт.

    mov [array2Db + bx + si], 'K';M(DS*16+ array2Db+SI+BX)
    M_Increment
    mov [array2Db + bx + si], 'V';M(DS*16+ array2Db+SI+BX)
    M_Increment
    mov [array2Db + bx + si], 'I';M(DS*16+ array2Db+SI+BX)

    M_Increment
    mov [array2Db + bx + si], 'I';M(DS*16+ array2Db+SI+BX)
    M_Increment
    mov [array2Db + bx + si], 'K';M(DS*16+ array2Db+SI+BX)
    M_Increment
    mov [array2Db + bx + si], 'V';M(DS*16+ array2Db+SI+BX)

    M_Increment
    mov [array2Db + bx + si], 'O';M(DS*16+ array2Db+SI+BX)
    M_Increment
    mov [array2Db + bx + si], 'D';M(DS*16+ array2Db+SI+BX)
    M_Increment
    mov [array2Db + bx + si], 'H';M(DS*16+ array2Db+SI+BX)

mov ah,4ch
mov al, [exCode] ; отримання коду виходу
int 21h		; виклик функції DOS 4ch
end Start
