
TITLE ЛР 1 Основи адресац?ї 
;------------------------------------------------------------------------------
;ЛР  №1.2
;------------------------------------------------------------------------------
; Програмування 3. Системне програмування
; Завдання:      Основи адресац?ї, вар?ант 0
; ВУЗ:          КНУУ "КП?"
; Факультет:    Ф?ОТ
; Курс:         2
; Група:       __ __ __
;------------------------------------------------------------------------------
; Автор:        __ __ __
; Дата:         __/__/__
;------------------------------------------------------------------------------
                                   ;I.ЗАГОЛОВОК ПРОГРАМИ
ideal
model small
stack 512

                                    ;II.МАКРОСИ
                                    ;2.1 Складний макрос для виходу з програми
MACRO M_Exit    ; Початок М
                                    ;\ Вих?д з програми з визначеним кодом
                                    ;\ На виход?:AL = код завершення програми

        mov     ah, 04Ch
        int     21h                 ; Виклик переривання DOS,
                                    ; ознака переривання в рег?стр? AH
ENDM M_Exit     ; К?нець М

                                    ;2.2 Складний макрос для ?н?ц?ал?зац?ї
MACRO M_Init 
                                    ;\ Инициализация DS и ES
                                    ;\ На входе:     ---
                                    ;\ На выходе:    ---
        mov     ax, @data           ; ax <- @data
        mov     ds, ax              ; ds <- ax
        mov     es, ax              ; es <- ax
ENDM M_Init-------------------------------------------------
                                 ;III.ПОЧАТОК СЕГМЕНТУ ДАНИХ
DATASEG

    ar_ans            DB 0CDH, 0CDH, 0CDH                        ;Оголошення двовим?рного масиву 
                      DB 0CDH, 0CDH, 0CDH 
                      DB 0CDH, 0CDH, 0CDH

    var_leng        DW ?                                 ; Array 
    index           DW 0
    ar_len          DW 7

CODESEG
                                 ;VI. ПОЧАТОК СЕГМЕНТУ КОДУ
    Start:         
        M_Init

    mov cx, [ar_len]                  ; cx init.
    mov si, 0                         ; si clear 
    go:
    cmp cx, 0                         ; Перев?рка счетчика цикла.
    jz exit                           ; Перех?д на метку, якщо ZF==1.
    mov bx, [index]                   ; 
    mov [num_arBuf1+si], bx           ; ?н?ц?ал?зац?я массиву. ?ндексна з? зм?щенням адресац?я. 
    inc [index]                       ; Зб?льшення зм?нної.
    dec cx                            ; Декр?мент ?ндексу
    jmp go                            ; Повернення на початок циклу
    exit:                             ; Вих?д з циклу 
    mov cx, [ar_len]                  ; cx init.
    mov si, 0                         ; si clear 

                                      ; *2 Array init example. Без CMP, особливост? рег?стру СХ. 
    lea si, num_arBuf2                ; Завантаження в SI ефективної адреси масиву num_arBuf2
    xor ax,ax                         ; АХ=0
    mov cx, [ar_len]                  ; В СХ довжину масиву num_arBuf2
    next:
    mov [DS:[si]], ax                 ; Поточнена ?ндексна адресац?я
    inc ax                            ; Зб?льшення ax
    inc si                            ; Зб?льшення si
    inc si                            ; Зб?льшення si дв?ч?, через те що слово
    dec cx                            ; Декремент л?чильника
    jnz next                          ; Перех?д у в к?нц? масиву.

                                      ; *3 Array init example. Без CMP, особливост? рег?стру СХ. 
    lea si, num_arBuf3                ; ?ндексна адресац?я.
                                      ;Аналог?чно п. 2. Спрощений синтаксис mov [si], ax
    xor ax,ax                         ;
    mov cx, [ar_len]
    next1:
    mov [si], ax
    inc si
    inc si
    dec cx
    jnz next1

                                M_Exit
    END Start
