TITLE V сod 3.1
;------------------------------------------------------------------------------
;ЛР  № 3.1 Кодування Кіріліца Windows-1251
;-----------------------------------------------------------------------------
;----------------I.ЗАГОЛОВОК ПРОГРАМИ-----------------------
IDEAL
MODEL SMALL
STACK 512
;-----------------II.МАКРОСИ----------------------------------------
;2.2 Складний макрос для ініціалізації
MACRO M_Init		; Початок макросу 
mov	ax, @data		; ax <- @data
mov	ds, ax			; ds <- ax
mov	es, ax			; es <- ax
ENDM M_Init		; Кінець макросу

;--------------------III.ПОЧАТОК СЕГМЕНТУ ДАНИХ
DATASEG
exCode db 0
;----------------------VI. ПОЧАТОК СЕГМЕНТУ КОДУ-----------------
CODESEG
Start:	
M_Init
;----------- Variant 1. Symbols to senter 0 memory-------------------
						;Налаштування ES на сторінку 0 відеопамяті 
	mov AX, 0B800h 			; 1. Сегментна адреса початку відеопамяті   
	mov ES, AX 				; 2. До ES 
	mov BX, 0 				; 3. Зміщення на початок екрану 
	mov SI, 2000				; 4. Зміщення центру eкрану 80*2*12+40*2
	mov DI, 3998			; 5. Зміщення кінець екрану 80*2*25-2
	mov [word ES:BX], 3130h		; 6. Символ на экран 
;----------- INT 21 ask keyboard-----------------------------	
	mov AH,01h 				; 9.Останов 
	int 21h 
	mov [word ES:SI], 3130h		; 7. Символ на экран
;----------- INT 21 ask keyboard-----------------------------	
	mov AH,01h 				; 9.Останов 
	int 21h 	
	mov [word ES:DI], 3130h	; 8. Симвл на экран 
;----------- INT 21 ask keyboard-----------------------------	
	mov AH,01h 				; 9.Останов 
	int 21h 
Exit:
     mov ah,4ch
     mov al,[exCode]
     int 21h
    end Start